# capture NaN value in new variable
# replace  NaN with Mode or most frequent values

# this method is for More missing values

In [26]:
import pandas as pd
import numpy as np

In [27]:
pd.set_option('DISPLAY.MAX_COLUMNS', None)

In [28]:
df= pd.read_csv('loan.csv',usecols=["BsmtQual","FireplaceQu","GarageType","SalePrice"  ])

In [29]:
df.isnull().sum()

BsmtQual        37
FireplaceQu    690
GarageType      81
SalePrice        0
dtype: int64

In [30]:
# most frequent value
df['BsmtQual'].value_counts().index[0]

'TA'

In [31]:
# most frequent value

df["BsmtQual"].mode()[0]

'TA'

In [32]:
df['BsmtQual_nan']= np.where(df['BsmtQual'].isnull(),1,0)

In [33]:
df.head()

  BsmtQual FireplaceQu GarageType  SalePrice  BsmtQual_nan
0       Gd         NaN     Attchd     208500             0
1       Gd          TA     Attchd     181500             0
2       Gd          TA     Attchd     223500             0
3       TA          Gd     Detchd     140000             0
4       Gd          TA     Attchd     250000             0

In [34]:
df['BsmtQual'].fillna(df['BsmtQual'].mode()[0], inplace=True)

In [35]:
df.isnull().sum()

BsmtQual          0
FireplaceQu     690
GarageType       81
SalePrice         0
BsmtQual_nan      0
dtype: int64

In [36]:
df

     BsmtQual FireplaceQu GarageType  SalePrice  BsmtQual_nan
0          Gd         NaN     Attchd     208500             0
1          Gd          TA     Attchd     181500             0
2          Gd          TA     Attchd     223500             0
3          TA          Gd     Detchd     140000             0
4          Gd          TA     Attchd     250000             0
...       ...         ...        ...        ...           ...
1455       Gd          TA     Attchd     175000             0
1456       Gd          TA     Attchd     210000             0
1457       TA          Gd     Attchd     266500             0
1458       TA         NaN     Attchd     142125             0
1459       TA         NaN     Attchd     147500             0

[1460 rows x 5 columns]

In [38]:
df.drop("BsmtQual", axis=1, inplace=True)

In [39]:
df

     FireplaceQu GarageType  SalePrice  BsmtQual_nan
0            NaN     Attchd     208500             0
1             TA     Attchd     181500             0
2             TA     Attchd     223500             0
3             Gd     Detchd     140000             0
4             TA     Attchd     250000             0
...          ...        ...        ...           ...
1455          TA     Attchd     175000             0
1456          TA     Attchd     210000             0
1457          Gd     Attchd     266500             0
1458         NaN     Attchd     142125             0
1459         NaN     Attchd     147500             0

[1460 rows x 4 columns]